% Функция для вывода таблицы в терминал
 
function printTable(x, y, z)
    % вывод шапки таблицы 
    fprintf('/----------------------------------------\\\n'); 
    fprintf('|  Аргумент  |  Функция   |   Интеграл   |\n'); 
    fprintf('|------------|------------|--------------|\n'); 
    % вывод содержимого таблицы
    
    for i = 1:length(x)
        fprintf('|%12.4f|%12.4f|%14.4f|\n', x(i), z(i), y(i))
    end
    % закроем таблицу 
    fprintf('\\----------------------------------------/\n'); 
end

