<template>
  <div id="home-page" class="content-section">
    <!-- Ваш новый текст -->
    <h1>Добро пожаловать на сайт о Умных Розетках для Систем Интернета Вещей!</h1>
    <div class="home-page-image-container">
      <img src="@/assets/photo0.jpg" alt="Умная Розетка" class="home-page-image">
    </div>
    <h2>Что такое Умные Розетки?</h2>
    <p>Умные розетки - это инновационные устройства, которые превращают обычные бытовые приборы в часть системы "умного дома". С помощью умных розеток вы можете управлять электроприборами дистанционно, используя смартфон или голосовые команды. Эти устройства подключаются к вашему домашнему Wi-Fi и позволяют вам контролировать, когда и как используются подключенные к ним устройства.</p>

    <!-- Преимущества умных розеток в виде списка -->
    <h2>Преимущества Умных Розеток</h2>
    <ul>
      <li>Энергосбережение: Умные розетки могут значительно сократить энергопотребление, автоматически выключая приборы, когда они не используются.</li>
      <li>Удобство использования:  Управление приборами на расстоянии - большое удобство. Вы можете включать и выключать приборы даже не находясь дома.</li>
      <li>Безопасность: Они помогают предотвратить перегрузку сети и возгорание, обеспечивая дополнительный уровень безопасности вашего дома.</li>
      <li>Вы можете настроить расписания для включения и выключения приборов, что особенно удобно для управления освещением и климат-контролем.</li>
    </ul>
    <h2>Как Начать Пользоваться Умными Розетками?</h2>
    <p>Выбор Умной Розетки: Первым шагом является выбор умной розетки, которая подходит вам по функциональности и цене.</p>
    <p>Установка: Установите умную розетку, следуя инструкции производителя. Обычно это простой процесс, не требующий специальных навыков.</p>
    <p>Подключение к Wi-Fi: Подключите устройство к домашней Wi-Fi сети, используя мобильное приложение.</p>
    <p>Конфигурация и Управление: Настройте розетку через приложение и начните управлять вашими устройствами дистанционно.</p>

    <!-- Таблица с часто задаваемыми вопросами -->
    <h2>Часто задаваемые вопросы</h2>
    <table>
      <tr>
        <th>Вопрос</th>
        <th>Ответ</th>
      </tr>
      <tr>
        <td>Нужен ли специальный Wi-Fi роутер?</td>
        <td>Нет, умные розетки обычно совместимы с большинством стандартных домашних Wi-Fi роутеров.</td>
      </tr>
      <tr>
        <td>Можно ли управлять умной розеткой, когда я не дома?</td>
        <td>Да, вы можете управлять розеткой из любой точки мира, где есть доступ в интернет.</td>
      </tr>
      <tr>
        <td>Безопасны ли умные розетки для моего дома?</td>
        <td>Да, они обеспечивают дополнительный уровень безопасности за счет возможности удаленного управления и мониторинга.</td>
      </tr>
    </table>
    <h2>Полезные Советы</h2>
    <ul>
      <li>Используйте умные розетки для управления освещением в вашем доме. Это не только удобно, но и поможет сэкономить на электроэнергии.</li>
      <li>Настройте автоматическое отключение приборов во время вашего отсутствия дома, чтобы снизить потребление энергии.</li>
      <li>Используйте функции голосового управления для еще большего удобства, особенно когда ваши руки заняты.</li>
    </ul>
    <div class="home-page-image-container">
      <img src="@/assets/photo1.jpg" alt="Умная Розетка" class="home-page-image">
  </div>
  </div>
  <hr>
</template>


<script>
export default {
  name: 'HomePage'
}
</script>

<style scoped>


/* Устанавливаем сероватый фон для всей страницы */
body {
  background-color: #f5f5f5;
}

/* Стили для раздела с текстом */
.content-section {
  background-color: white; /* Белый фон для раздела */
  padding: 20px;
  border-radius: 15px; /* Закругленные углы */
  box-shadow: 0 4px 8px rgba(0, 0, 0, 0.5); /* Небольшая тень для эффекта "выпуклости" */
  margin: 20px; /* Добавляем отступ, чтобы отделить раздел от краев экрана */
}

/* Стили для заголовков и списка */
.content-section h2 {
  margin-top: 20px;
}

.content-section ul {
  list-style-type: disc;
  margin-left: 40px;
}


.content-section {
  padding: 20px;
}

.content-section h2 {
  margin-top: 20px;
}

.content-section ul {
  list-style-type: disc;
  margin-left: 40px;
}


/* Стили для таблицы */
table {
  width: 100%;
  border-collapse: separate;
  border-spacing: 0;
  margin-top: 20px;
  box-shadow: 0 4px 8px rgba(0, 0, 0, 0.3); /* Добавляем тень для объемного эффекта */
}

th, td {
  padding: 10px;
  text-align: left;
  border-bottom: 1px solid #ddd; /* Малозаметная граница */
}

th {
  background-color: #f8f8f8; /* Нежный цвет фона для заголовков */
  border-top: 2px solid #ddd; /* Верхняя граница для заголовков */
  text-transform: uppercase; /* Заглавные буквы для текста заголовков */
}

td {
  background-color: #fff; /* Белый фон для ячеек */
}

/* Стиль для строк таблицы при наведении */
tr:hover {
  background-color: #f1f1f1; /* Светло-серый фон при наведении */
}


.home-page-image-container {
  text-align: center; /* Центрирование содержимого */
}

.home-page-image {
  max-width: 100%;
  height: auto;
  max-height: 400px; /* Максимальная высота изображения */
}

@media (max-width: 800px) {
  .home-page-image {
    max-height: 300px; /* Адаптивная высота изображения для средних экранов */
  }
}

@media (max-width: 550px) {
  .home-page-image {
    max-height: 200px; /* Адаптивная высота изображения для малых экранов */
  }
}


</style>

