<template>
  <div id="smart-plug-info" class="content-section">
    <h2>Технологии и Устройство Умных Розеток</h2>
    <p>Введение в Технологию Умных Розеток</p>
    <p>Умные розетки - это ключевой компонент современных систем "умного дома", позволяющие пользователям управлять бытовыми приборами удаленно. Эти инновационные устройства используют различные технологии для обеспечения удобства, безопасности и эффективности в использовании электроэнергии.</p>

    <h3>Основные Компоненты Умной Розетки</h3>
    <ul>
      <li>Wi-Fi/Bluetooth Модуль: Позволяет розетке подключаться к домашней сети для удаленного управления и передачи данных.</li>
      <li>Микроконтроллер: Является "мозгом" устройства, обрабатывает команды и контролирует работу розетки.</li>
      <li>Реле: Электромеханический переключатель, который включает или отключает питание подключенного устройства.</li>
      <li>Датчики Тока и Напряжения: Используются для мониторинга потребления энергии и могут помочь в предотвращении перегрузок и коротких замыканий.</li>
    </ul>
    <div class="smart-plug-image-container">
      <img src="@/assets/photo2.jpg" alt="Умная Розетка" class="smart-plug-image">
    </div>
    <h3>Технологии Соединения</h3>
    <ol>
      <li>Wi-Fi: Популярный выбор для умных розеток, Wi-Fi обеспечивает стабильное и дальнобойное соединение, позволяя управлять розеткой даже на расстоянии.</li>
      <li>Bluetooth: Иногда используется в умных розетках для локального управления. Ограничен диапазоном действия Bluetooth.</li>
    </ol>
    <div class="smart-plug-image-container">
      <img src="@/assets/photo4.jpg" alt="Умная Розетка" class="smart-plug-image">
    </div>
    <h3>Интеграция и Совместимость</h3>
    <ul>
      <li>Совместимость с Голосовыми Ассистентами: Большинство умных розеток можно интегрировать с Яндекс Алисой, Amazon Alexa, Google Assistant и Apple HomeKit для управления голосом.</li>
      <li>Поддержка Множества Платформ: Умные розетки часто поддерживают различные платформы управления, включая специализированные приложения, IFTTT (If This Then That) и другие сервисы автоматизации.</li>
    </ul>
    <div class="smart-plug-image-container">
      <img src="@/assets/photo3.jpg" alt="Умная Розетка" class="smart-plug-image">
    </div>
    <h3>Функции Безопасности и Мониторинга</h3>
    <dl>
      <dt>Защита от Перегрузки:</dt>
      <dd>Современные умные розетки часто оснащены функциями защиты от перегрузки, автоматически отключаясь при обнаружении потенциальной опасности.</dd>
      <dt>Мониторинг Энергопотребления:</dt>
      <dd>Датчики тока и напряжения позволяют отслеживать энергопотребление в реальном времени, помогая оптимизировать использование электроэнергии.</dd>
    </dl>

    <h3>Принципы Работы Умных Розеток</h3>
    <dl>
      <dt>Получение Команд:</dt>
      <dd>Умные розетки получают команды через Wi-Fi или Bluetooth от мобильных приложений или голосовых ассистентов.</dd>
      <dt>Обработка Команд:</dt>
      <dd>Микроконтроллер интерпретирует полученные команды и активирует реле для включения или выключения питания.</dd>
    </dl>

    <h3>Продвинутые Функции</h3>
    <ul>
      <li>Расписания и Таймеры: Пользователи могут настроить автоматическое включение/выключение устройств в определенное время или в ответ на определенные события.</li>
      <li>Сценарии Автоматизации: Интеграция с системами умного дома для создания сложных сценариев, таких как включение света при открытии двери.</li>
    </ul>
    <h3>Примеры Сценариев Использования Умных Розеток</h3>
    <table>
  <tr>
    <th>Сценарий</th>
    <th>Описание</th>
  </tr>
  <tr>
    <td>Управление Освещением</td>
    <td>Автоматизируйте освещение вашего дома, настраивая умные розетки на включение света в определенное время, например, когда начинает темнеть.</td>
  </tr>
  <tr>
    <td>Дистанционное Управление Бытовыми Приборами</td>
    <td>Включайте или выключайте приборы (например, кофеварку или утюг) дистанционно, чтобы они были готовы к вашему приходу домой или для предотвращения опасности.</td>
  </tr>
  <tr>
    <td>Энергосбережение</td>
    <td>Используйте мониторинг энергопотребления для оптимизации использования электроэнергии, автоматически выключая приборы, когда они не используются.</td>
  </tr>
  <tr>
    <td>Безопасность в Отпуске</td>
    <td>Создайте видимость присутствия в доме, используя умные розетки для включения света и других приборов в разное время, когда вы в отпуске.</td>
  </tr>
  <tr>
    <td>Голосовое Управление</td>
    <td>Интегрируйте умные розетки с голосовым ассистентом для удобного управления приборами, не вставая с места.</td>
  </tr>
</table>
    <h3>Заключение</h3>
    <p>Технологии умных розеток - это симбиоз инноваций в области беспроводной связи, электроники и программного обеспечения, привносящие удобство и эффективность в повседневную жизнь и развитие систем умного дома.</p>
    <div class="smart-plug-image-container">
      <img src="@/assets/photo5.jpg" alt="Умная Розетка" class="smart-plug-image">
    </div>
  </div>
</template>

<script>
export default {
  name: 'SmartPlugInfo'
}
</script>

<style scoped>
/* Стили для раздела с информацией об умных розетках */
.content-section {
  background-color: white; /* Белый фон для раздела */
  padding: 20px;
  border-radius: 15px; /* Закругленные углы */
  box-shadow: 0 4px 8px rgba(0, 0, 0, 0.5); /* Небольшая тень для эффекта "выпуклости" */
  margin: 20px; /* Отступ, чтобы отделить раздел от краев экрана */
}

.content-section ul {
  list-style-type: circle; /* Стиль списка */
  margin-left: 20px;
}
.content-section {
  padding: 20px;
}

.content-section ul {
  list-style-type: circle;
  margin-left: 20px;
}


/* Стили для таблицы */
table {
  width: 100%;
  border-collapse: separate;
  border-spacing: 0;
  margin-top: 20px;
  box-shadow: 0 4px 8px rgba(0, 0, 0, 0.3); /* Добавляем тень для объемного эффекта */
}

th, td {
  padding: 10px;
  text-align: left;
  border-bottom: 1px solid #ddd; /* Малозаметная граница */
}

th {
  background-color: #f8f8f8; /* Нежный цвет фона для заголовков */
  border-top: 2px solid #ddd; /* Верхняя граница для заголовков */
  text-transform: uppercase; /* Заглавные буквы для текста заголовков */
}

td {
  background-color: #fff; /* Белый фон для ячеек */
}

/* Стиль для строк таблицы при наведении */
tr:hover {
  background-color: #f1f1f1; /* Светло-серый фон при наведении */
}

.smart-plug-image-container {
  text-align: center; /* Центрирование содержимого */
}

.smart-plug-image {
  max-width: 100%;
  height: auto;
  max-height: 400px; /* Максимальная высота изображения */
}

@media (max-width: 800px) {
  .smart-plug-image {
    max-height: 300px; /* Адаптивная высота изображения для средних экранов */
  }
}

@media (max-width: 550px) {
  .smart-plug-image {
    max-height: 200px; /* Адаптивная высота изображения для малых экранов */
  }
}



</style>
